---
type: ViewPrintedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# ViewPrintedEventArgs

`Autodesk.Revit.DB.Events.ViewPrintedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Index | 2010 | `public int Index { get ; }` |
| Property | TotalViews | 2010 | `public int TotalViews { get ; }` |
| Property | View | 2010 | `public View View { get ; }` |